In [6]:
import pandas as pd
import numpy as np
from handle_categorical_features import *

In [ ]:
import pandas as pd
import numpy as np
from handle_categorical_features import *
df = pd.read_csv('/home/iqube/Downloads/data.xls')

In [7]:
df = pd.read_csv('/home/iqube/Downloads/data.xls')

In [3]:
df.head(
        )

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   object
 1   price          4600 non-null   float64
 2   bedrooms       4600 non-null   float64
 3   bathrooms      4600 non-null   float64
 4   sqft_living    4600 non-null   int64
 5   sqft_lot       4600 non-null   int64
 6   floors         4600 non-null   float64
 7   waterfront     4600 non-null   int64
 8   view           4600 non-null   int64
 9   condition      4600 non-null   int64
 10  sqft_above     4600 non-null   int64
 11  sqft_basement  4600 non-null   int64
 12  yr_built       4600 non-null   int64
 13  yr_renovated   4600 non-null   int64
 14  street         4600 non-null   object
 15  city           4600 non-null   object
 16  statezip       4600 non-null   object
 17  country        4600 non-null   object
dtypes: float64(4), int64(9), object(5)
memory usage: 647.0+ KB

In [3]:
import pandas as pd
import numpy as np
from handle_categorical_features import *
df = pd.read_csv('/home/iqube/Downloads/data.xls')
features = df.columns.to_list()

In [6]:
object_features = [ feature for feature in features if df[feature].dtype == 'O']

In [7]:
for i in object_features:

    print(f"Feature {i} has {len(df[i].unique())} unique values")
    print("\n")
    print("*"*100)

Feature date has 70 unique values


****************************************************************************************************
Feature street has 4525 unique values


****************************************************************************************************
Feature city has 44 unique values


****************************************************************************************************
Feature statezip has 77 unique values


****************************************************************************************************
Feature country has 1 unique values


****************************************************************************************************

In [8]:
df.drop(labels =['date','street','statezip','country'],axis = 1 , inplace = True)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   float64
 1   bedrooms       4600 non-null   float64
 2   bathrooms      4600 non-null   float64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   float64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  yr_built       4600 non-null   int64
 12  yr_renovated   4600 non-null   int64
 13  city           4600 non-null   object
dtypes: float64(4), int64(9), object(1)
memory usage: 503.3+ KB

In [10]:
features = df.columns

In [11]:
for i in features:
    print(i)

    print(f"Feature {i} has {len(df[i].unique())} unique values and of type {df[i].dtypes}")
    print("\n")
    print("*"*100)

price
Feature price has 1741 unique values and of type float64


****************************************************************************************************
bedrooms
Feature bedrooms has 10 unique values and of type float64


****************************************************************************************************
bathrooms
Feature bathrooms has 26 unique values and of type float64


****************************************************************************************************
sqft_living
Feature sqft_living has 566 unique values and of type int64


****************************************************************************************************
sqft_lot
Feature sqft_lot has 3113 unique values and of type int64


****************************************************************************************************
floors
Feature floors has 6 unique values and of type float64


****************************************************************************************************
waterfront
Feature waterfront has 2 unique values and of type int64


****************************************************************************************************
view
Feature view has 5 unique values and of type int64


****************************************************************************************************
condition
Feature condition has 5 unique values and of type int64


****************************************************************************************************
sqft_above
Feature sqft_above has 511 unique values and of type int64


****************************************************************************************************
sqft_basement
Feature sqft_basement has 207 unique values and of type int64


****************************************************************************************************
yr_built
Feature yr_built has 115 unique values and of type int64


****************************************************************************************************
yr_renovated
Feature yr_renovated has 60 unique values and of type int64


****************************************************************************************************
city
Feature city has 44 unique values and of type object


****************************************************************************************************

In [12]:
features

Index(['price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors',
       'waterfront', 'view', 'condition', 'sqft_above', 'sqft_basement',
       'yr_built', 'yr_renovated', 'city'],
      dtype='object')

In [13]:
df.drop(labels=['yr_renovated','yr_built'],axis=1,inplace=True)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   float64
 1   bedrooms       4600 non-null   float64
 2   bathrooms      4600 non-null   float64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   float64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  city           4600 non-null   object
dtypes: float64(4), int64(7), object(1)
memory usage: 431.4+ KB

In [15]:
features = df.columns

In [16]:
for i in features:
    print(i)

    print(f"Feature {i} has {len(df[i].unique())} unique values and of type {df[i].dtypes}")
    print("\n")
    print("*"*100)

price
Feature price has 1741 unique values and of type float64


****************************************************************************************************
bedrooms
Feature bedrooms has 10 unique values and of type float64


****************************************************************************************************
bathrooms
Feature bathrooms has 26 unique values and of type float64


****************************************************************************************************
sqft_living
Feature sqft_living has 566 unique values and of type int64


****************************************************************************************************
sqft_lot
Feature sqft_lot has 3113 unique values and of type int64


****************************************************************************************************
floors
Feature floors has 6 unique values and of type float64


****************************************************************************************************
waterfront
Feature waterfront has 2 unique values and of type int64


****************************************************************************************************
view
Feature view has 5 unique values and of type int64


****************************************************************************************************
condition
Feature condition has 5 unique values and of type int64


****************************************************************************************************
sqft_above
Feature sqft_above has 511 unique values and of type int64


****************************************************************************************************
sqft_basement
Feature sqft_basement has 207 unique values and of type int64


****************************************************************************************************
city
Feature city has 44 unique values and of type object


****************************************************************************************************

In [17]:
df.drop_duplicates(inplace=True)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   float64
 1   bedrooms       4600 non-null   float64
 2   bathrooms      4600 non-null   float64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   float64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  city           4600 non-null   object
dtypes: float64(4), int64(7), object(1)
memory usage: 431.4+ KB

In [8]:
import pandas as pd
import numpy as np
from handle_categorical_features import *
df = pd.read_csv('/home/iqube/Downloads/data.xls')
features = df.columns.to_list()
categorical_features = [feature for feature in features if len(df[feature].unique()) <= 50]

In [20]:
for i in categorical_features:


    print("_"* 100)
    print("\n")
    print(f"Feature { i }:")
    for j in df[i].unique():
        print(j,end='\n')

____________________________________________________________________________________________________


Feature bedrooms:
3.0
5.0
4.0
2.0
6.0
7.0
9.0
1.0
8.0
0.0
____________________________________________________________________________________________________


Feature bathrooms:
1.5
2.5
2.0
2.25
1.0
1.75
2.75
3.0
3.25
3.5
8.0
4.25
4.0
3.75
5.0
4.5
5.75
1.25
6.5
4.75
0.75
5.25
5.5
6.25
0.0
6.75
____________________________________________________________________________________________________


Feature floors:
1.5
2.0
1.0
2.5
3.0
3.5
____________________________________________________________________________________________________


Feature waterfront:
0
1
____________________________________________________________________________________________________


Feature view:
0
4
1
2
3
____________________________________________________________________________________________________


Feature condition:
3
5
4
2
1
____________________________________________________________________________________________________


Feature city:
Shoreline
Seattle
Kent
Bellevue
Redmond
Maple Valley
North Bend
Lake Forest Park
Sammamish
Auburn
Des Moines
Bothell
Federal Way
Kirkland
Issaquah
Woodinville
Normandy Park
Fall City
Renton
Carnation
Snoqualmie
Duvall
Burien
Covington
Inglewood-Finn Hill
Kenmore
Newcastle
Mercer Island
Black Diamond
Ravensdale
Clyde Hill
Algona
Skykomish
Tukwila
Vashon
Yarrow Point
SeaTac
Medina
Enumclaw
Snoqualmie Pass
Pacific
Beaux Arts Village
Preston
Milton

In [21]:
for i in categorical_features:


    print("_"* 100)
    print("\n")
    print(f"Feature { i }:")
    print(df[i].value_counts())

____________________________________________________________________________________________________


Feature bedrooms:
bedrooms
3.0    2032
4.0    1531
2.0     566
5.0     353
6.0      61
1.0      38
7.0      14
8.0       2
0.0       2
9.0       1
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature bathrooms:
bathrooms
2.50    1189
1.00     743
1.75     629
2.00     427
2.25     419
1.50     291
2.75     276
3.00     167
3.50     162
3.25     136
3.75      37
4.50      29
4.25      23
4.00      23
0.75      17
4.75       7
5.00       6
5.25       4
5.50       4
1.25       3
6.25       2
0.00       2
8.00       1
5.75       1
6.50       1
6.75       1
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature floors:
floors
1.0    2174
2.0    1811
1.5     444
3.0     128
2.5      41
3.5       2
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature waterfront:
waterfront
0    4567
1      33
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature view:
view
0    4140
2     205
3     116
4      70
1      69
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature condition:
condition
3    2875
4    1252
5     435
2      32
1       6
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature city:
city
Seattle                1573
Renton                  293
Bellevue                286
Redmond                 235
Issaquah                187
Kirkland                187
Kent                    185
Auburn                  176
Sammamish               175
Federal Way             148
Shoreline               123
Woodinville             115
Maple Valley             96
Mercer Island            86
Burien                   74
Snoqualmie               71
Kenmore                  66
Des Moines               58
North Bend               50
Covington                43
Duvall                   42
Lake Forest Park         36
Bothell                  33
Newcastle                33
SeaTac                   29
Tukwila                  29
Vashon                   29
Enumclaw                 28
Carnation                22
Normandy Park            18
Clyde Hill               11
Medina                   11
Fall City                11
Black Diamond             9
Ravensdale                7
Pacific                   6
Algona                    5
Yarrow Point              4
Skykomish                 3
Preston                   2
Milton                    2
Inglewood-Finn Hill       1
Snoqualmie Pass           1
Beaux Arts Village        1
Name: count, dtype: int64

In [22]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [23]:
feature = 'bedrooms'
class_to_count = 3

# Count occurrences of each class
class_counts = df[feature].value_counts()

# Get frequency of the specific class
class_frequency = class_counts.get(class_to_count, 0)

print(f"The frequency of class '{class_to_count}' in feature '{feature}' is: {class_frequency}")

The frequency of class '3' in feature 'bedrooms' is: 2032

In [24]:
vc = df['bedrooms'].value_counts()

In [25]:
vc

bedrooms
3.0    2032
4.0    1531
2.0     566
5.0     353
6.0      61
1.0      38
7.0      14
8.0       2
0.0       2
9.0       1
Name: count, dtype: int64

In [26]:
(vc)

bedrooms
3.0    2032
4.0    1531
2.0     566
5.0     353
6.0      61
1.0      38
7.0      14
8.0       2
0.0       2
9.0       1
Name: count, dtype: int64

In [27]:
def check_class_frequency(dataframe,feature):

    class_counts = dataframe[feature].value_counts()
    class_to_count = dataframe[feature].unique()
    class_with_low_frequency = []



    for i in class_to_count:
        
        class_frequency = class_counts.get(i, 0)
        l = len(dataframe)
        
        if class_frequency > (0.005 * l):
            
            class_with_low_frequency.append(i)
            
    return class_with_low_frequency

In [28]:
for i in categorical_features:

    l = check_class_frequency(df,i)
    print(l)

[3.0, 5.0, 4.0, 2.0, 6.0, 1.0]
[1.5, 2.5, 2.0, 2.25, 1.0, 1.75, 2.75, 3.0, 3.25, 3.5, 3.75, 4.5]
[1.5, 2.0, 1.0, 2.5, 3.0]
[0, 1]
[0, 4, 1, 2, 3]
[3, 5, 4, 2]
['Shoreline', 'Seattle', 'Kent', 'Bellevue', 'Redmond', 'Maple Valley', 'North Bend', 'Lake Forest Park', 'Sammamish', 'Auburn', 'Des Moines', 'Bothell', 'Federal Way', 'Kirkland', 'Issaquah', 'Woodinville', 'Renton', 'Snoqualmie', 'Duvall', 'Burien', 'Covington', 'Kenmore', 'Newcastle', 'Mercer Island', 'Tukwila', 'Vashon', 'SeaTac', 'Enumclaw']

In [29]:
l

['Shoreline',
 'Seattle',
 'Kent',
 'Bellevue',
 'Redmond',
 'Maple Valley',
 'North Bend',
 'Lake Forest Park',
 'Sammamish',
 'Auburn',
 'Des Moines',
 'Bothell',
 'Federal Way',
 'Kirkland',
 'Issaquah',
 'Woodinville',
 'Renton',
 'Snoqualmie',
 'Duvall',
 'Burien',
 'Covington',
 'Kenmore',
 'Newcastle',
 'Mercer Island',
 'Tukwila',
 'Vashon',
 'SeaTac',
 'Enumclaw']

In [30]:
def check_class_frequency(dataframe,feature):

    class_counts = dataframe[feature].value_counts()
    class_to_count = dataframe[feature].unique()
    class_with_high_frequency = []



    for i in class_to_count:
        
        class_frequency = class_counts.get(i, 0)
        l = len(dataframe)
        
        if class_frequency > (0.005 * l):
            
            class_with_high_frequency.append(i)
    return class_with_high_frequency

In [31]:
def create_rare_class(dataframe , feature, classes_with_high_frequency):

    c = tuple(zip(classes_with_high_frequency,classes_with_high_frequency))
    d = dict(c)
    print(d)
    dataframe[feature] = dataframe[feature].map(d)
    dataframe[feature].fillna(value = 'Rare', inplace = True)
    return dataframe[feature]

In [32]:
l = check_class_frequency(df,'bedrooms')

In [33]:
l

[3.0, 5.0, 4.0, 2.0, 6.0, 1.0]

In [110]:
df['bedrooms'] = create_rare_class(df,'bedrooms',l)

{3.0: 3.0, 5.0: 5.0, 4.0: 4.0, 2.0: 2.0, 6.0: 6.0, 1.0: 1.0}

/tmp/ipykernel_4052/242768182.py:7: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Rare' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  dataframe[feature].fillna(value = 'Rare', inplace = True)

In [111]:
df['bedrooms'].value_counts()

bedrooms
3.0     2032
4.0     1531
2.0      566
5.0      353
6.0       61
1.0       38
Rare      19
Name: count, dtype: int64

In [112]:
df['bedrooms'].unique()

array([3.0, 5.0, 4.0, 2.0, 6.0, 'Rare', 1.0], dtype=object)

In [113]:
df['bedrooms'].isnull().sum()

0

In [35]:
categorical_features

['bedrooms', 'bathrooms', 'floors', 'waterfront', 'view', 'condition', 'city']

In [12]:
df2 = df[categorical_features]
df2.isnull().sum()

Series([], dtype: float64)

In [23]:
import pandas as pd
import numpy as np
from handle_categorical_features import *
# Create a sample DataFrame
data = {
    'Category': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C', np.nan],
    'Value': [10, 20, np.nan, 30, 40, 50, np.nan, 60, 70, 80],
    'Other': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', 'X']
}

df = pd.DataFrame(data)

# Print the DataFrame
print("Original DataFrame:")

features = df.columns.to_list()
categorical_features = [feature for feature in features if len(df[feature].unique()) <= 50]
df

Original DataFrame:

  Category  Value Other
0        A   10.0     X
1        B   20.0     Y
2        C    NaN     Z
3        A   30.0     X
4        B   40.0     Y
5        C   50.0     Z
6        A    NaN     X
7        B   60.0     Y
8        C   70.0     Z
9      NaN   80.0     X

In [2]:
start_categorical_feature_preprocessing(df[categorical_features],categorical_features)

Before
0      A
1      B
2      C
3      A
4      B
5      C
6      A
7      B
8      C
9    NaN
Name: Category, dtype: object
Filled null values of feature Category with class 'A'
After
0    A
1    B
2    C
3    A
4    B
5    C
6    A
7    B
8    C
9    A
Name: Category, dtype: object
{'A': 'A', 'B': 'B', 'C': 'C'}
Before
0    10.0
1    20.0
2     NaN
3    30.0
4    40.0
5    50.0
6     NaN
7    60.0
8    70.0
9    80.0
Name: Value, dtype: float64
Filled null values of feature Value with class '10.0'
After
0    10.0
1    20.0
2    10.0
3    30.0
4    40.0
5    50.0
6    10.0
7    60.0
8    70.0
9    80.0
Name: Value, dtype: float64
{10.0: 10.0, 20.0: 20.0, 30.0: 30.0, 40.0: 40.0, 50.0: 50.0, 60.0: 60.0, 70.0: 70.0, 80.0: 80.0}
Before
0    X
1    Y
2    Z
3    X
4    Y
5    Z
6    X
7    Y
8    Z
9    X
Name: Other, dtype: object
Filled null values of feature Other with class 'X'
After
0    X
1    Y
2    Z
3    X
4    Y
5    Z
6    X
7    Y
8    Z
9    X
Name: Other, dtype: object
{'X': 'X', 'Y': 'Y', 'Z': 'Z'}

In [3]:
get_global_dataframe()

  Category  Value Other
0        A   10.0     X
1        B   20.0     Y
2        C   10.0     Z
3        A   30.0     X
4        B   40.0     Y
5        C   50.0     Z
6        A   10.0     X
7        B   60.0     Y
8        C   70.0     Z
9        A   80.0     X

In [73]:
get_global_features()

Index(['bedrooms', 'bathrooms', 'floors', 'waterfront', 'view', 'condition',
       'city'],
      dtype='object')

In [14]:
df

,Unnamed: 0,Date,Natural_Gas_Price,Natural_Gas_Vol.,Crude_oil_Price,Crude_oil_Vol.,Copper_Price,Copper_Vol.,Bitcoin_Price,Bitcoin_Vol.,...,Berkshire_Price,Berkshire_Vol.,Netflix_Price,Netflix_Vol.,Amazon_Price,Amazon_Vol.,Meta_Price,Meta_Vol.,Gold_Price,Gold_Vol.
0,0,2/2/2024,2.079,NaN,72.28,NaN,3.8215,NaN,"43,194.70",42650,...,"5,89,498",10580,564.64,4030000,171.81,117220000,474.99,84710000,"2,053.70",NaN
1,1,1/2/2024,2.050,161340.0,73.82,577940.0,3.8535,NaN,"43,081.40",47690,...,"5,81,600",9780,567.51,3150000,159.28,66360000,394.78,25140000,"2,071.10",260920.0
2,2,31-01-2024,2.100,142860.0,75.85,344490.0,3.9060,NaN,"42,580.50",56480,...,"5,78,020",9720,564.11,4830000,155.20,49690000,390.14,20010000,"2,067.40",238370.0
3,3,30-01-2024,2.077,139750.0,77.82,347240.0,3.9110,NaN,"42,946.20",55130,...,"5,84,680",9750,562.85,6120000,159.00,42290000,400.06,18610000,"2,050.90",214590.0
4,4,29-01-2024,2.490,3590.0,76.78,331930.0,3.8790,NaN,"43,299.80",45230,...,"5,78,800",13850,575.79,6880000,161.26,42840000,401.02,17790000,"2,034.90",1780.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1008,1008,8/1/2020,2.141,242560.0,59.61,1210000.0,2.8120,77700.0,"8,059.60",1190000,...,"3,39,188",190,339.26,7110000,94.60,70240000,215.22,13490000,"1,560.20",813410.0
1009,1009,7/1/2020,2.162,163010.0,62.70,582650.0,2.7935,59470.0,"8,155.70",1010000,...,"3,38,901",280,330.75,4740000,95.34,82680000,213.06,15110000,"1,574.30",435870.0
1010,1010,6/1/2020,2.135,154680.0,63.27,724240.0,2.7900,59570.0,"7,759.10",786750,...,"3,40,210",280,335.83,5670000,95.14,81310000,212.60,17070000,"1,568.80",558970.0
1011,1011,3/1/2020,2.130,144670.0,63.05,885860.0,2.7870,74750.0,"7,343.10",936290,...,"3,39,155",220,325.90,3800000,93.75,75330000,208.67,11200000,"1,552.40",436740.0
1012,1012,2/1/2020,2.122,164570.0,61.18,486870.0,2.8250,72460.0,"6,967.00",632780,...,"3,42,261",410,329.81,4350000,94.90,80720000,209.78,12090000,"1,528.10",270550.0

In [18]:
# Create a sample DataFrame
data = {
    'Category': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C', np.nan],
    'Value': [10, 20, np.nan, 30, 40, 50, np.nan, 60, 70, 80],
    'Other': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', 'X']
}

df = pd.DataFrame(data)

# Print the DataFrame
print("Original DataFrame:")
df

Original DataFrame:

  Category  Value Other
0        A   10.0     X
1        B   20.0     Y
2        C    NaN     Z
3        A   30.0     X
4        B   40.0     Y
5        C   50.0     Z
6        A    NaN     X
7        B   60.0     Y
8        C   70.0     Z
9      NaN   80.0     X

In [4]:
df['Category'].fillna(value = df['Category'].mode())

0      A
1      B
2      C
3      A
4      B
5      C
6      A
7      B
8      C
9    NaN
Name: Category, dtype: object

In [6]:
df['Category'].mode()[0]

'A'

In [27]:

def encode_features(dataframe,feature):
   
    a = dataframe[feature].unique()
    print(a)
    b = range(len(a))
    print(b)
    c = zip(a,b)
    d = dict(tuple(c))
    print(d)
    data[feature]=dataframe[feature].map(d)
    print(dataframe[feature])

In [13]:
def fill_categorical_null(dataframe,feature):


    if dataframe[feature].isnull().sum() < (0.35 * len(dataframe)):
        
        
        print("Before")
        print(dataframe[feature])
        dataframe[feature].fillna(value = dataframe[feature].mode()[0],inplace = True)
        handle_categorical_features.update_dataframe(dataframe)    
        print(f"Filled null values of feature {feature} with class '{dataframe[feature].mode()[0]}'")
        print('After')
        print(dataframe[feature])

In [28]:

encode_features(df,'Category')

[0 1 2 3]
range(0, 4)
{0: 0, 1: 1, 2: 2, 3: 3}
0    0
1    1
2    2
3    0
4    1
5    2
6    0
7    1
8    2
9    3
Name: Category, dtype: int64

In [29]:
data

{'Category': 0    0
 1    1
 2    2
 3    0
 4    1
 5    2
 6    0
 7    1
 8    2
 9    3
 Name: Category, dtype: int64,
 'Value': [10, 20, nan, 30, 40, 50, nan, 60, 70, 80],
 'Other': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', 'X']}

In [18]:
a = df['Category'].unique()
print(a)
b = range(len(a))
print(b)
c = zip(a,b)
d = dict(tuple(c))

['A' 'B' 'C' nan]
range(0, 4)

In [19]:
df['Category']=df['Category'].map(d)
print(df['Category'])

0    0
1    1
2    2
3    0
4    1
5    2
6    0
7    1
8    2
9    3
Name: Category, dtype: int64